let data = [
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '1', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '2', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '3', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '4', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 3, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '5', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 6, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '6', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 1, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '7', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 4, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '8', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 7, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '9', // Месяц 
        'weeks': 6, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 2, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '10', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 30, // Дней в месяце 28 29 30 31
        'firstDay': 5, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '11', // Месяц 
        'weeks': 5, // Недель в месяце 4 5 6

    },
    {

        'days': 31, // Дней в месяце 28 29 30 31
        'firstDay': 7, // С какого дня недели начинается месяц - 1 2 ... 6 7
        'month': '12', // Месяц 
        'weeks': 6, // Недель в месяце 4 5 6

    },

];